{
    "module": "keras",
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "trainable": true,
      "dtype": "float32",
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_shape": [null, 1000],
            "dtype": "float32",
            "sparse": false,
            "name": "input_layer"
          },
          "registered_name": null
        },
        {
          "module": "keras.layers",
          "class_name": "Embedding",
          "config": {
            "name": "embedding",
            "trainable": true,
            "dtype": "float32",
            "input_dim": 200001,
            "output_dim": 32,
            "embeddings_initializer": {
              "module": "keras.initializers",
              "class_name": "RandomUniform",
              "config": {
                "minval": -0.05,
                "maxval": 0.05,
                "seed": null
              },
              "registered_name": null
            },
            "embeddings_regularizer": null,
            "activity_regularizer": null,
            "embeddings_constraint": null,
            "mask_zero": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [null, 1000]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Bidirectional",
          "config": {
            "name": "bidirectional",
            "trainable": true,
            "dtype": "float32",
            "layer": {
              "module": "keras.layers",
              "class_name": "LSTM",
              "config": {
                "name": "forward_lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "zero_output_for_mask": false,
                "units": 32,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "recurrent_initializer": {
                  "module": "keras.initializers",
                  "class_name": "OrthogonalInitializer",
                  "config": {
                    "gain": 1,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {
  
                  },
                  "registered_name": null
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0,
                "recurrent_dropout": 0,
                "seed": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 1000, 32]
              }
            },
            "merge_mode": "concat",
            "backward_layer": {
              "module": "keras.layers",
              "class_name": "LSTM",
              "config": {
                "name": "backward_lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": true,
                "stateful": false,
                "unroll": false,
                "zero_output_for_mask": false,
                "units": 32,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "recurrent_initializer": {
                  "module": "keras.initializers",
                  "class_name": "OrthogonalInitializer",
                  "config": {
                    "gain": 1,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {
  
                  },
                  "registered_name": null
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0,
                "recurrent_dropout": 0,
                "seed": null
              },
              "registered_name": null,
              "build_config": {
                "input_shape": [null, 1000, 32]
              }
            }
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [null, 1000, 32]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {
  
              },
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [null, 64]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {
  
              },
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [null, 128]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {
  
              },
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [null, 256]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "dtype": "float32",
            "units": 6,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {
  
              },
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [null, 128]
          }
        }
      ],
      "build_input_shape": [null, 1000]
    },
    "registered_name": null,
    "build_config": {
      "input_shape": [null, 1000]
    },
    "compile_config": {
      "optimizer": {
        "module": "keras.optimizers",
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.00100000004749745,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        },
        "registered_name": null
      },
      "loss": {
        "module": "keras.losses",
        "class_name": "BinaryCrossentropy",
        "config": {
          "name": "binary_crossentropy",
          "reduction": "sum_over_batch_size",
          "from_logits": false,
          "label_smoothing": 0,
          "axis": -1
        },
        "registered_name": null
      },
      "loss_weights": null,
      "metrics": [
        "accuracy",
        {
          "module": "keras.metrics",
          "class_name": "Precision",
          "config": {
            "name": "precision",
            "dtype": "float32",
            "thresholds": null,
            "top_k": null,
            "class_id": null
          },
          "registered_name": null
        },
        {
          "module": "keras.metrics",
          "class_name": "Recall",
          "config": {
            "name": "recall",
            "dtype": "float32",
            "thresholds": null,
            "top_k": null,
            "class_id": null
          },
          "registered_name": null
        }
      ],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false
    }
  }